<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Pandas" data-toc-modified-id="Pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Pandas</a></span></li><li><span><a href="#Series-en-Pandas" data-toc-modified-id="Series-en-Pandas-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Series en Pandas</a></span></li><li><span><a href="#DataFrames-en-Pandas" data-toc-modified-id="DataFrames-en-Pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>DataFrames en Pandas</a></span><ul class="toc-item"><li><span><a href="#Crear-un-DataFrame" data-toc-modified-id="Crear-un-DataFrame-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Crear un DataFrame</a></span></li><li><span><a href="#Agregar-columnas-a-un-DataFrame" data-toc-modified-id="Agregar-columnas-a-un-DataFrame-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Agregar columnas a un DataFrame</a></span></li><li><span><a href="#Agregar-filas-con-append()" data-toc-modified-id="Agregar-filas-con-append()-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Agregar filas con append()</a></span></li></ul></li><li><span><a href="#Observando-las-características-de-un-Data-Frame" data-toc-modified-id="Observando-las-características-de-un-Data-Frame-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Observando las características de un Data Frame</a></span><ul class="toc-item"><li><span><a href="#shape()" data-toc-modified-id="shape()-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>shape()</a></span></li><li><span><a href="#describe()" data-toc-modified-id="describe()-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>describe()</a></span></li><li><span><a href="#unique()--Valores-únicos-de-una-columna" data-toc-modified-id="unique()--Valores-únicos-de-una-columna-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>unique()  Valores únicos de una columna</a></span></li><li><span><a href="#value_counts()-Cantidad-de-Valores-únicos-de-una-columna" data-toc-modified-id="value_counts()-Cantidad-de-Valores-únicos-de-una-columna-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>value_counts() Cantidad de Valores únicos de una columna</a></span></li></ul></li><li><span><a href="#Funciones-agregadas-por-columnas" data-toc-modified-id="Funciones-agregadas-por-columnas-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Funciones agregadas por columnas</a></span><ul class="toc-item"><li><span><a href="#Promedio" data-toc-modified-id="Promedio-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Promedio</a></span></li><li><span><a href="#Desvío-Standard" data-toc-modified-id="Desvío-Standard-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Desvío Standard</a></span></li><li><span><a href="#Mínimo" data-toc-modified-id="Mínimo-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Mínimo</a></span></li><li><span><a href="#Máximo" data-toc-modified-id="Máximo-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Máximo</a></span></li></ul></li></ul></div>

# COMPUTACIÓN CIENTÍFICA
# Situación Profesional 2
# CLASE 1
**Prof. Ricardo Piña - Erica Bongiovanni**

## Pandas

Entre las librerías de Python existe **Pandas**. 

Anteriormente hemos usado NumPy para trabajar con vectores, matrices y tensores (arrays de un, dos o 3 ejes) que son las estructuras más básicas de los datos, **Pandas** se ubica "un piso por encima de NumPy", permitiendo trabajar con estructuras de datos más sofisticadas como los denominados **Data Frames** muy similares a las **planillas de cálculo tipo Excel**, los cuales tienen ciertas características tabulares muy deseables al hacer análsis de nuestros datos, como por ejemplo:

- Los Data Frames permiten dar **nombres** a las columnas y mantener indexadas las filas.
- Es posible **agregar o quitar** filas o columnas y hacer operaciones entre ellas.
- Es posible filtrar y ordenar filas o columnas fácilmente.
- Es capaz de leer y guardar datos en diversos formatos como: 
    - csv, archivos de texto, archivos de Excel
    - bases de datos SQL
    - HTML
    - XML
    - JSON
    - HDF5 (formato jerárquico de datos; muy veloz)

Por estas características, Pandas es una excelente herramienta para hacer **Data Wrangling**, es decir transformar datos **"crudos"** en datos aptos para su análisis. Generalmente ** Data Wrangling** implica las siguientes tareas referidas a los datos:  

- Limpiar
- Combinar
- Adaptar
- Evaluar


Pandas es una excelente herramienta para trabajar con datos organizados en forma de **tabla** y es una alternativa viable ante lenguajes como R que son más específicos para el uso de las matemáticas y estadísticas.

Por otro lado, podemos mencionar algunas debildades de Pandas, como por ejemplo que carece de implementación de modelos de Machine Learning como por ejemplo los Árboles de Decisión que vimos en materias anteriores; sólo provee funcionalidades básicas para Regresión Lineal.  

Cuando necesitemos aplicar técnicas de Machine Learning usaremos NumPy y Pandas en conjunto con otras librerías como **MatPlotLib para gráficar** y  **Sci-Kit** Learn para la creación de modelos...

Ahora veremos algunas funcionalidades de Pandas y luego las aplicaremos en nuestros casos de Sistemas de Recomendación.

In [1]:
import pandas as pd
import numpy as np

## Series en Pandas

En Pandas una Serie es un conjunto de valores indexados, es decir que Pandas le agrega un número de índice que comienza su numeracion en 0.  
Se utiliza la función:  
~~~
pd.Series( [array de NumPy])
~~~

In [13]:
serie=pd.Series([10,20,30])
serie

0    10
1    20
2    30
dtype: int64

los datos que nos muestra la lista de dato son: 
* en la primer columna nos muestra un indice
* en la segunda los valores cargados 
* en la ultima fila nos dice que tipo de dato es

Es posible acceder a los valores o a los índices por separado:

In [14]:
serie.values

array([10, 20, 30], dtype=int64)

al colocar la instruccion **values** nos muestra la lista como si fuese un array

In [15]:
serie.index

RangeIndex(start=0, stop=3, step=1)

al colocar index nos mostrará el inicio, el final sin contar este y la escala en la que pasa dato a dato, como la funcion arange en numpy

De la misma manera que para un array de NumPy es posible acceder a los datos a través del índice que les corresponde, usando la notación usual de corchetes:

In [16]:
serie[2]

30

In [17]:
# al colocar dos valores separados por : me dará los datos desde la posicion del primero hasta el segundo valor sin 
# contar al ultimo
serie[0:2]

0    10
1    20
dtype: int64

Hasta aquí da la impresión que no hay diferencia entre las Series de Pandas y los arrays de NumPy, sin embargo en el caso de NumPy el ínidice está definido *implícitamente* y es un valor numérico asignado por NumPy.  
En cambio en Pandas podemos asignar números o cadenas arbitrarias como ínidice:

In [54]:
serie2=pd.Series([10,20,30,40],index=["a","b","c","d"])
serie2

a    10
b    20
c    30
d    40
dtype: int64

Lo interesante es que aún podemos acceder a los valores usando el índice:

In [14]:
serie2["b"]

20

In [26]:
serie2[0]

10

In [35]:
serie2["a":"c"]

a    10
b    20
c    30
dtype: int64

## DataFrames en Pandas

### Crear un DataFrame

Una forma de crear un dataframe es crear uno vacío y luego agregar sus **columnas**:

In [139]:
# Creamos un dataframe vacío
df_01=pd.DataFrame()

### Agregar columnas a un DataFrame

 Agregamos un par de columnas:

In [140]:
df_01["Nombre"]=["Juan","Pedro","Ana"]
df_01["Edad"]=[40,25,30]

Veamos qué aspecto tiene df_01 hasta ahora:

In [141]:
# Escriba aquí su código
df_01

  Nombre  Edad
0   Juan    40
1  Pedro    25
2    Ana    30

Agreguemos una columna más, la columna "Nota" con los valores 7,9 y 4

In [142]:
# Escriba aquí su código
df_01["Notas"]=[7,9,4]

Veamos qué tenemos en df_01

In [143]:
# Escriba aquí su código
df_01

  Nombre  Edad  Notas
0   Juan    40      7
1  Pedro    25      9
2    Ana    30      4

### Agregar filas con append()

Una vez que se ha creado un DataFrame, es posible también agregar filas, cada fila nueva se debe agregar como una Serie

In [144]:
nueva_fila=pd.Series(["carlos",22,6],index=["Nombre","Edad","Notas"])

In [145]:
df_01.append(nueva_fila,ignore_index=True)

   Nombre  Edad  Notas
0    Juan    40      7
1   Pedro    25      9
2     Ana    30      4
3  carlos    22      6

Pero fíjese cómo es en realidad df_01

In [146]:
# Escriba aquí su código
df_01

  Nombre  Edad  Notas
0   Juan    40      7
1  Pedro    25      9
2    Ana    30      4

En realidad cuando hicimos el append *creó un nuevo dataframe* y mantuvo al anterior inalterado.  

Si quisiéramos agregarlo finalmente, deberíamos asignar el resultado a df_01:

In [147]:
# Escriba aquí su código
df_01=df_01.append(nueva_fila,ignore_index=True)
# Muestre df_01
df_01

   Nombre  Edad  Notas
0    Juan    40      7
1   Pedro    25      9
2     Ana    30      4
3  carlos    22      6

Si pasamos los índices, los podemos poner en cualquier orden:

In [148]:
nueva_fila_2=pd.Series([19,4,"Marta"],index=["Edad","Notas","Nombre"])
df_01=df_01.append(nueva_fila_2, ignore_index= True)
df_01

   Nombre  Edad  Notas
0    Juan    40      7
1   Pedro    25      9
2     Ana    30      4
3  carlos    22      6
4   Marta    19      4

Agregue ahora los datos de Nota 4, para María que tiene 20 años y asigne el resultado a df_01:

In [149]:
# Escriba aquí su código
nueva_fila_3=pd.Series(["María",20,4],index=["Nombre","Edad","Notas"])
df_01=df_01.append(nueva_fila_3, ignore_index= True)
df_01

   Nombre  Edad  Notas
0    Juan    40      7
1   Pedro    25      9
2     Ana    30      4
3  carlos    22      6
4   Marta    19      4
5   María    20      4

También podemos agregar varias filas, una forma de hacerlo es agregar un nuevo dataframe:

- Cree un nuevo DataFrame con las mismas columnas que df_01, llámelo df_02
- Cargue los datos de 
    - Martín, 22 , 5
    - Claudia, 19, 9
    - Esteban, 24, 8

In [150]:
df_02=pd.DataFrame()

In [151]:
# Escriba aquí su código
df_02["Nombre"]=["Martín","Claudia","Esteban"]
df_02["Edad"]=[22,19,24]
df_02["Notas"]=[5,9,8]
# Muestre df_02 para verificar
df_02

    Nombre  Edad  Notas
0   Martín    22      5
1  Claudia    19      9
2  Esteban    24      8

- Agregue estos datos a df_01
- Mueste cómo quedó df_01

In [152]:
# Escriba aquí su código
df_01=df_01.append(df_02,ignore_index=True)
df_01

    Nombre  Edad  Notas
0     Juan    40      7
1    Pedro    25      9
2      Ana    30      4
3   carlos    22      6
4    Marta    19      4
5    María    20      4
6   Martín    22      5
7  Claudia    19      9
8  Esteban    24      8

## Observando las características de un Data Frame

### shape()

Podemos conocer la cantidad de filas y columas con .shape()

In [153]:
df_01.shape

(9, 3)

### describe()

Esta es una gran herramienta para obtener mucha información sobre las columnas o variables numéricas con muy poco código!

Nos ofrece: 
- Cantidad de valores 
- Media
- Desvío Standard
- Valor Mínimo
- Valor para el 1er, 2do y 3er cuartil
- Valor máximo  

**Nota:** los cálculos anteriores **no** incluyen los *missing values*

In [101]:
df_01.describe()

            Edad     Notas
count   4.000000  4.000000
mean   29.250000  6.500000
std     7.889867  2.081666
min    22.000000  4.000000
25%    24.250000  5.500000
50%    27.500000  6.500000
75%    32.500000  7.500000
max    40.000000  9.000000

### unique()  Valores únicos de una columna

obtengo la lista de los datos sin saber la cantidad de veces que se repite

In [159]:
df_01.Nombre.unique()

array(['Juan', 'Pedro', 'Ana', 'carlos', 'Marta', 'María', 'Martín',
       'Claudia', 'Esteban'], dtype=object)

In [158]:
df_01.Edad.unique()

array([40, 25, 30, 22, 19, 20, 24], dtype=int64)

In [157]:
df_01.Notas.unique()

array([7, 9, 4, 6, 5, 8], dtype=int64)

### value_counts() Cantidad de Valores únicos de una columna

obtengo la lista de datos y me dice cuantas veces se repite

In [154]:
df_01.Nombre.value_counts()

Marta      1
Ana        1
Juan       1
Esteban    1
Martín     1
Pedro      1
María      1
carlos     1
Claudia    1
Name: Nombre, dtype: int64

In [155]:
df_01.Edad.value_counts()

22    2
19    2
30    1
24    1
25    1
40    1
20    1
Name: Edad, dtype: int64

In [156]:
df_01.Notas.value_counts()

4    3
9    2
8    1
7    1
6    1
5    1
Name: Notas, dtype: int64

## Funciones agregadas por columnas

### Promedio

También podemos obtener estos valores para cada columna de manera independiente, y como las columnas tienen nombre, ahora es más fácil referirise a ellas:

Utilice nombreDataFrame.NombreColumna.Funcion()

Calcule el promedio de Edad:

In [160]:
# Escriba aquí su código
df_01.Edad.mean()

24.555555555555557

In [161]:
df_01.Notas.mean()

6.222222222222222

si el valor no es numerico dará error

### Desvío Standard

Calcule el desvío standard para la Nota

In [163]:
# Escriba aquí su código
df_01.Notas.std()

2.1081851067789197

In [164]:
df_01.Edad.std()

6.747427493332387

### Mínimo

Calcule la mínima Nota

In [165]:
# Escriba aquí su código
df_01.Notas.min()

4

In [167]:
df_01.Edad.min()

19

### Máximo

Calcule la mayor Edad

In [166]:
df_01.Notas.max()

9

In [168]:
df_01.Edad.max()

40

### Suma de toda la columna

In [24]:
df_01.Notas.sum()

NameError: name 'df_01' is not defined

In [ ]:
df_01.Edad.sum()

## Cargar data frames desde un archivo

In [8]:
DatosArchivoR=pd.read_csv("datos/C1-ratings.csv", sep=";")
DatosArchivoR

   5  0  4  2  3
0  0  1  2  2  2
1  1  4  0  0  0
2  4  3  4  2  1
3  2  0  4  5  3
4  0  0  0  5  0
5  2  4  3  0  2
6  1  0  2  0  4
7  2  5  4  3  0
8  3  0  5  4  5

La lista creada no toma todos los datos, ya que al inicio toma los datos de la fila 0 como su cabecera, por lo que al agregar header = None determinamos que no tendrá cabecera

In [9]:
DatosArchivoR=pd.read_csv("datos/C1-ratings.csv", sep=";", header = None)
DatosArchivoR

   0  1  2  3  4
0  5  0  4  2  3
1  0  1  2  2  2
2  1  4  0  0  0
3  4  3  4  2  1
4  2  0  4  5  3
5  0  0  0  5  0
6  2  4  3  0  2
7  1  0  2  0  4
8  2  5  4  3  0
9  3  0  5  4  5

## Ejercicio

Crear una lista que tenga los datos de los archivos de Empleados, Mozos y personal de planta

In [11]:
Empleados=pd.read_csv("datos/C1-Empleados.csv", sep=";")
Empleados

    Legajo   Apellido    Nombre  Categoría  Antigüedad  Básico
0     1236     García   Claudia          1           2   12000
1     1247     Moyano    Javier          2           5   16800
2     1250      Pérez      Raul          3           6   21600
3     1258     García     Pablo          5           7   31200
4     1269   Martínez  Carolina          6           8   36000
5     1280      López    Franco          8           9   45600
6     1291     Romero   Esteban          7           5   40800
7     1302      Gómez  Federico          9           4   50400
8     1313      López    Mirtha          5           2   31200
9     1324     Cabral    Mónica          4           3   26400
10    1335      Arias   Daniela          2           1   16800
11    1346      Pérez     Laura          6           4   36000
12    1357       Ruiz  Josefina          2           5   16800
13    1368    Lacasio  Giorgina          3           2   21600
14    1379     Barilá   Martina          4           6   26400
15    1390     Romero    Emilio          5           7   31200
16    1401   Yadarola    Adrián          6           5   36000
17    1412  Cornavaca   Esteban          4           8   26400
18    1423     Moreno    Romina          5           4   31200
19    1434      Limia  Josefina          2           2   16800
20    1445      Pérez     Sofia          3           1   21600
21    1456     Vargas     Carla          6           5   36000
22    1467  Rodriguez   Mariana          5           2   31200
23    1478  Fernandez    Roxana          4           4   26400
24    1489    Pereyra    Sabina          5           2   31200
25    1500    Rosales   Silvina          6           5   36000
26    1511    Pedraza   Rodrigo          2           4   16800
27    1522       Roca     David          3           5   21600
28    1533    Medrano      Ivan          5           7   31200
29    1544      Reyes      Raul          4           4   26400
30    1555     Lozano   Ricardo          5           8   31200
31    1566       Zaya   Estaban          6           5   36000
32    1577    Victori    Walter          5           2   31200
33    1588     Romero    Sergio          4           4   26400
34    1599    Peralta   Gustavo          5           5   31200
35    1610   Villagra   Gabriel          6           7   36000
36    1621  Villafañe   Mariano          5           8   31200
37    1632  Visintini     Jorge          5           9   31200

In [34]:
Empleados.describe()

            Legajo  Categoría  Antigüedad        Básico
count    38.000000  38.000000   38.000000     38.000000
mean   1429.157895   4.552632    4.789474  29052.631579
std     121.181465   1.735128    2.267966   8328.613552
min    1236.000000   1.000000    1.000000  12000.000000
25%    1326.750000   3.250000    3.250000  22800.000000
50%    1428.500000   5.000000    5.000000  31200.000000
75%    1530.250000   5.750000    6.750000  34800.000000
max    1632.000000   9.000000    9.000000  50400.000000

In [35]:
Empleados.Categoría.value_counts()

5    12
6     7
4     6
2     5
3     4
9     1
8     1
7     1
1     1
Name: Categoría, dtype: int64

In [16]:
Mozos=pd.read_csv("datos/C1-Mozos.csv", sep=",", header= None)
Mozos

     0                 1        2      3     4
0  100     Garcia, Pablo  Experto  15.00  8530
1   50  Ramirez, Gustavo  Juniors  12.50  1248
2   75  Martinez, Sergio  Experto  15.00  2456
3  150     Diller, Mario  Juniors  12.50  9524
4  125   Romanutti, Juan   Master  14.25  2135
5   25   Casale, Ricardo   Master  14.25  2145
6  175      Molina, Hugo  Juniors  12.50  2954

In [21]:
# Al solo trabajar con la columna dos puedo determinar cuantas veces se repite cada puesto
Mozos[2].value_counts()

Juniors    3
Experto    2
Master     2
Name: 2, dtype: int64

In [33]:
Mozos.describe()

                0          3            4
count    7.000000   7.000000     7.000000
mean   100.000000  13.714286  4141.714286
std     54.006172   1.176405  3387.863177
min     25.000000  12.500000  1248.000000
25%     62.500000  12.500000  2140.000000
50%    100.000000  14.250000  2456.000000
75%    137.500000  14.625000  5742.000000
max    175.000000  15.000000  9524.000000

In [15]:
PersonalPlanta=pd.read_csv("datos/C1-PersonalPlanta.csv", sep=";")
PersonalPlanta

,Código,Empleado,Tarea,FechaIngreso,AñoIngreso,Categoría,Básico
0,127,"Garcia, Claudia",Maestranza,01/06/2010,2010,1,4587
1,131,"Moyano, Javier",Administrativo,01/12/2012,2012,2,1236
2,135,"Perez, Raul",Cajero,01/08/2008,2008,3,7521
3,139,"Echavarri, Pablo",Personal Auxiliar,01/06/2012,2012,1,3574
4,143,"Daniotti, Carolina",Auxiliar Especializado,01/06/2010,2010,2,1594
5,147,"Gonzalez, Franco",Vendedor,01/03/2014,2014,3,6545
6,151,"Migotti, Esteban",Maestranza,01/08/2008,2008,1,3254
7,155,"Gomez, Federico",Administrativo,01/06/2012,2012,5,2154

In [22]:
# Cantidad de veces que se repiten las tareas
PersonalPlanta.Tarea.value_counts()

Maestranza                2
Administrativo            2
Vendedor                  1
Cajero                    1
Auxiliar Especializado    1
Personal Auxiliar         1
Name: Tarea, dtype: int64

In [23]:
PersonalPlanta.Básico.sum()

30465

In [25]:
PersonalPlanta.Básico.min()

1236

In [26]:
PersonalPlanta.Básico.max()

7521

In [27]:
PersonalPlanta.Básico.mean()

3808.125

In [29]:
PersonalPlanta.Básico.std()

2283.44185308682

In [32]:
PersonalPlanta.describe()

           Código  AñoIngreso  Categoría       Básico
count    8.000000     8.00000    8.00000     8.000000
mean   141.000000  2010.75000    2.25000  3808.125000
std      9.797959     2.12132    1.38873  2283.441853
min    127.000000  2008.00000    1.00000  1236.000000
25%    134.000000  2009.50000    1.00000  2014.000000
50%    141.000000  2011.00000    2.00000  3414.000000
75%    148.000000  2012.00000    3.00000  5076.500000
max    155.000000  2014.00000    5.00000  7521.000000